## Terraform Plan & Apply �

### Plan: ✅ Success
### Apply: ✅ Success

🎉 **Infrastructure changes applied successfully!** This PR is ready to merge.

<details>
<summary>Show Plan Output</summary>

```terraform
aws_iam_policy.ecs_autoscale_policy: Refreshing state... [id=arn:aws:iam::225989367801:policy/budgeteer-ecs-autoscale-policy]
aws_iam_role.task_role: Refreshing state... [id=budgeteer-task-role]
data.aws_vpc.default: Reading...
aws_ecr_repository.main: Refreshing state... [id=budgeteer-repo]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:225989367801:cluster/budgeteer]
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
aws_iam_role.task_execution: Refreshing state... [id=budgeteer-task-execution-role]
aws_iam_role.deployment_role: Refreshing state... [id=budgeteer-deployment-role]
aws_cloudwatch_log_group.app: Refreshing state... [id=/ecs/budgeteer]
data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
aws_iam_role.ecs_task_cloudwatch: Refreshing state... [id=budgeteer-ecs-cloudwatch-role]
data.aws_caller_identity.current: Read complete after 0s [id=225989367801]
aws_iam_role.ecs_autoscale_role: Refreshing state... [id=budgeteer-ecs-autoscale-role]
aws_iam_policy.task_role_policy: Refreshing state... [id=arn:aws:iam::225989367801:policy/budgeteer-task-policy]
aws_iam_policy.task_execution_custom: Refreshing state... [id=arn:aws:iam::225989367801:policy/budgeteer-task-execution-custom]
aws_iam_role_policy_attachment.task_execution_policy: Refreshing state... [id=budgeteer-task-execution-role-20250912091034379600000004]
aws_iam_role_policy_attachment.ecs_cloudwatch_policy: Refreshing state... [id=budgeteer-ecs-cloudwatch-role-20250912091034361000000003]
aws_iam_role_policy_attachment.ecs_autoscale_policy: Refreshing state... [id=budgeteer-ecs-autoscale-role-20250912091034343200000002]
aws_iam_role_policy_attachment.task_role_policy: Refreshing state... [id=budgeteer-task-role-20250912091034548500000006]
aws_iam_role_policy_attachment.task_execution_custom: Refreshing state... [id=budgeteer-task-execution-role-20250912091034422900000005]
aws_iam_policy.deployment_policy: Refreshing state... [id=arn:aws:iam::225989367801:policy/budgeteer-deployment-policy]
aws_ecr_lifecycle_policy.main: Refreshing state... [id=budgeteer-repo]
aws_ecs_task_definition.app: Refreshing state... [id=budgeteer]
data.aws_vpc.default: Read complete after 2s [id=vpc-0bc3c549fb54ed59b]
data.aws_subnets.default: Reading...
aws_security_group.alb: Refreshing state... [id=sg-03c0584a284f36c5b]
aws_lb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:225989367801:targetgroup/budgeteer-tg/f510f9e70552a858]
data.aws_subnets.default: Read complete after 0s [id=ap-southeast-2]
aws_security_group.ecs: Refreshing state... [id=sg-089f0ea95c776c33b]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:225989367801:loadbalancer/app/budgeteer-alb/78690ba2fdeff02a]
aws_lb_listener.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:225989367801:listener/app/budgeteer-alb/78690ba2fdeff02a/4b407e3631800208]
aws_cloudfront_distribution.app[0]: Refreshing state... [id=E17XHYN2EJMBAB]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:225989367801:service/budgeteer/budgeteer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ap-southeast-2:225989367801:service/budgeteer/budgeteer"
        name                               = "budgeteer"
        tags                               = {
            "Name" = "budgeteer-service"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-southeast-2:225989367801:task-definition/budgeteer:6" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-2:225989367801:task-definition/budgeteer:6" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-southeast-2:225989367801:task-definition/budgeteer" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "budgeteer" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
        tags                     = {
            "Name" = "budgeteer-task-definition"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

<details>
<summary>Show Apply Output</summary>

```terraform
[0m[1maws_ecs_task_definition.app: Destroying... [id=budgeteer][0m[0m
[0m[1maws_ecs_task_definition.app: Destruction complete after 1s[0m
[0m[1maws_ecs_task_definition.app: Creating...[0m[0m
[0m[1maws_ecs_task_definition.app: Creation complete after 0s [id=budgeteer][0m
[0m[1maws_ecs_service.main: Modifying... [id=arn:aws:ecs:ap-southeast-2:225989367801:service/budgeteer/budgeteer][0m[0m
[0m[1maws_ecs_service.main: Modifications complete after 1s [id=arn:aws:ecs:ap-southeast-2:225989367801:service/budgeteer/budgeteer][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 1 changed, 1 destroyed.
[0m[0m[1m[32m
Outputs:

[0malb_hostname = "budgeteer-alb-1872744527.ap-southeast-2.elb.amazonaws.com"
api_base_url = "https://djeq4v2shvqau.cloudfront.net"
autoscale_role_arn = "arn:aws:iam::225989367801:role/budgeteer-ecs-autoscale-role"
cloudfront_url = "https://djeq4v2shvqau.cloudfront.net"
cloudwatch_role_arn = "arn:aws:iam::225989367801:role/budgeteer-ecs-cloudwatch-role"
deployment_role_arn = "arn:aws:iam::225989367801:role/budgeteer-deployment-role"
ecr_repository_arn = "arn:aws:ecr:ap-southeast-2:225989367801:repository/budgeteer-repo"
ecr_repository_name = "budgeteer-repo"
ecr_repository_url = "225989367801.dkr.ecr.ap-southeast-2.amazonaws.com/budgeteer-repo"
ecs_autoscale_policy_arn = "arn:aws:iam::225989367801:policy/budgeteer-ecs-autoscale-policy"
ecs_cluster_name = "budgeteer"
ecs_service_name = "budgeteer"
load_balancer_url = "http://budgeteer-alb-1872744527.ap-southeast-2.elb.amazonaws.com"
log_group_name = "/ecs/budgeteer"
security_group_alb_id = "sg-03c0584a284f36c5b"
security_group_ecs_id = "sg-089f0ea95c776c33b"
target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:225989367801:targetgroup/budgeteer-tg/f510f9e70552a858"
task_execution_policy_arn = "arn:aws:iam::225989367801:policy/budgeteer-task-execution-custom"
task_execution_role_arn = "arn:aws:iam::225989367801:role/budgeteer-task-execution-role"
task_policy_arn = "arn:aws:iam::225989367801:policy/budgeteer-task-policy"
task_role_arn = "arn:aws:iam::225989367801:role/budgeteer-task-role"

```

</details>